# Append => Hanya menggabungkan atau menambah baris saja

In [1]:
# Load library
import pandas as pd
from IPython.display import display

# Membuat series data
s1 = pd.Series([1, 2, 3, 4, 5, 6])
s2 = pd.Series(["a", "b", "c", "d", "e", "f"])
s2_append_s1 = s2.append(s1)
display(s2_append_s1)

# Membuat dataframe df1 <-> df2
df1 = pd.DataFrame({"a":[1,2],
                    "b":[3,4]})
df2 = pd.DataFrame({"b":[1,2],
                    "a":[3,4]})
df2_append_df1 = df2.append(df1)
display(df1)
display(df2)
display(df2_append_df1)

0    a
1    b
2    c
3    d
4    e
5    f
0    1
1    2
2    3
3    4
4    5
5    6
dtype: object

   a  b
0  1  3
1  2  4

   b  a
0  1  3
1  2  4

   b  a
0  1  3
1  2  4
0  3  1
1  4  2

# Concat => Menggabungkan & Menambah dalam arah Row-wise atau Column-wise

In [2]:
# Load library
import pandas as pd
from IPython.display import display

# Membuat dataframe
df1 = pd.DataFrame({"a" : [1, 2],
                    "b" : [3, 4]})
df2 = pd.DataFrame({"b" : [1, 2],
                    "a" : [3, 4]})

# Menggabungan concat row-wise
print("Concat Row-Wise")
row_wise_concat = pd.concat([df2, df1])
display(row_wise_concat)

# Menggabungkan concat column-wise
print("Concat Column-Wise")
column_wise_concat = pd.concat([df2, df1], axis=1)
display(column_wise_concat)

# Penambahan identifier --> membentuk hasil penggabungan multiindex
print("Multiindex - concat : ")
multiindex_concat = pd.concat([df2, df1], axis=0, keys=["df2", "df1"])
display(multiindex_concat)

Concat Row-Wise

   b  a
0  1  3
1  2  4
0  3  1
1  4  2

Concat Column-Wise

   b  a  a  b
0  1  3  1  3
1  2  4  2  4

Multiindex - concat :

       b  a
df2 0  1  3
    1  2  4
df1 0  3  1
    1  4  2

# Merge - Part 1 - Index Tunggal

In [4]:
# Load library
import pandas as pd

# Buat dataframe df1 & df2
df1 = pd.DataFrame({
    "key" : ["k1","k2","k3","k4","k5"],
    "val1" : [200, 500, 0, 500, 100],
    "val2" : [30, 50, 100, 20, 10]
})
df2 = pd.DataFrame({
    "key" : ["k1", "k3", "k4", "k7", "k10"],
    "val3" : [1, 2, 3, 4, 5],
    "val4" :[6, 7, 8, 9, 10]
})

# merge yang ekivalen dengan SQL left join
merge_df_left = pd.merge(left=df1, right=df2, how="left", left_on="key", right_on="key")
print("Merge - Left")
display(merge_df_left)
# merge yang ekivalen dengan SQL right join
merge_df_right = pd.merge(left=df1, right=df2, how="right", right_on="key", left_on="key")
print("Merge - right")
display(merge_df_right)
# merge yang ekivalen dengan SQL inner join 
merge_df_inner = pd.merge(left=df1, right=df2, how="inner", right_on="key", left_on="key")
print("Merge - inner")
display(merge_df_inner)
# merge yang ekivalen dengan SQL outer join
merge_df_inner = pd.merge(left=df1, right=df2, how="outer", right_on="key", left_on="key")
print("Merge - outer")
display(merge_df_inner)

Merge - Left

  key  val1  val2  val3  val4
0  k1   200    30   1.0   6.0
1  k2   500    50   NaN   NaN
2  k3     0   100   2.0   7.0
3  k4   500    20   3.0   8.0
4  k5   100    10   NaN   NaN

Merge - right

   key   val1   val2  val3  val4
0   k1  200.0   30.0     1     6
1   k3    0.0  100.0     2     7
2   k4  500.0   20.0     3     8
3   k7    NaN    NaN     4     9
4  k10    NaN    NaN     5    10

Merge - inner

  key  val1  val2  val3  val4
0  k1   200    30     1     6
1  k3     0   100     2     7
2  k4   500    20     3     8

Merge - outer

   key   val1   val2  val3  val4
0   k1  200.0   30.0   1.0   6.0
1   k2  500.0   50.0   NaN   NaN
2   k3    0.0  100.0   2.0   7.0
3   k4  500.0   20.0   3.0   8.0
4   k5  100.0   10.0   NaN   NaN
5   k7    NaN    NaN   4.0   9.0
6  k10    NaN    NaN   5.0  10.0

# Merge - Part 2 - Multi Index

In [5]:
# Load dataset
import pandas as pd

# Membuat dataframe df1 dan df2
df1 = pd.DataFrame({
    "key" : ["k1", "k2", "k3", "k4", "k5"],
    "val1" : [200, 500, 0, 500, 100],
    "val2" : [30, 50, 100, 20, 10]
}).set_index(["key","val2"])
df2 = pd.DataFrame({
    "key" : ["k1", "k3", "k5", "k7", "k10"],
    "val3" : [1, 2, 3, 4, 5],
    "val4" : [6, 7, 8, 9, 10]
}).set_index(["key","val3"])
print("Dataframe ke - 1")
display(df1)
print("Dataframe ke - 2")
display(df2)
print("Merge dataframe yang memiliki multiindex")
df_merge = pd.merge(df1.reset_index(), df2.reset_index())
display(df_merge)

Dataframe ke - 1

          val1
key val2
k1  30     200
k2  50     500
k3  100      0
k4  20     500
k5  10     100

Dataframe ke - 2

          val4
key val3
k1  1        6
k3  2        7
k5  3        8
k7  4        9
k10 5       10

Merge dataframe yang memiliki multiindex

  key  val2  val1  val3  val4
0  k1    30   200     1     6
1  k3   100     0     2     7
2  k5    10   100     3     8

# Join

In [10]:
import pandas as pd
from IPython.display import display

df1 = pd.DataFrame({
    "key" : ["k1", "k2", "k3", "k4", "k5"],
    "val1" : [200, 500, 0, 500, 100],
    "val2" : [30, 50, 100, 20, 10]
})
df2 = pd.DataFrame({
    "key" : ["k1", "k3", "k5", "k7", "k10"],
    "val3" : [1, 2, 3, 4, 5],
    "val4" : [6, 7, 8, 9, 10]
})

join_df_dasar = df1.set_index("key").join(df2.set_index("key"))
join_df_dasar_outer = df1.set_index("key").join(df2.set_index("key"), how="outer")
join_df_dasar_inner = df1.set_index("key").join(df2.set_index("key"), how="inner")
display(join_df_dasar)
display(join_df_dasar_outer)
display(join_df_dasar_inner)

     val1  val2  val3  val4
key
k1    200    30   1.0   6.0
k2    500    50   NaN   NaN
k3      0   100   2.0   7.0
k4    500    20   NaN   NaN
k5    100    10   3.0   8.0

      val1   val2  val3  val4
key
k1   200.0   30.0   1.0   6.0
k10    NaN    NaN   5.0  10.0
k2   500.0   50.0   NaN   NaN
k3     0.0  100.0   2.0   7.0
k4   500.0   20.0   NaN   NaN
k5   100.0   10.0   3.0   8.0
k7     NaN    NaN   4.0   9.0

     val1  val2  val3  val4
key
k1    200    30     1     6
k3      0   100     2     7
k5    100    10     3     8

# Quiz

In [12]:
df1 = pd.DataFrame({
   'key':['k1','k2','k3','k4','k5'],
   'val1':[200, 500, 0, 500, 100],
   'val2':[30, 50, 100, 20, 10],
  
})
df2 = pd.DataFrame({
   'key':['k1','k1','k5','k7','k10'],
   'val3':[1,2,3,4,5],
   'val4':[6,7,8,8,10]
})

# data = pd.merge(df1, df2, validate="1:1")
# display(data)

# Dataset

In [4]:
import pandas as pd

data = pd.DataFrame({
    "kelas" : 6*["A"] + 6*["B"],
    "murid" : 2*["A1"] + 2*["A2"] + 2*["A3"] + 2*["B1"] + 2*["B2"] + 2*["B3"],
    "pelajaran" : 6*["math", "english"],
    "nilai" : [90, 60, 70, 85, 50, 60, 100, 40, 95, 80, 60, 45]
}, columns=["kelas","murid","pelajaran","nilai"])
display(data)

for column in data.columns:
    print("Unique value %s: %s" %(column, data[column].unique()))

   kelas murid pelajaran  nilai
0      A    A1      math     90
1      A    A1   english     60
2      A    A2      math     70
3      A    A2   english     85
4      A    A3      math     50
5      A    A3   english     60
6      B    B1      math    100
7      B    B1   english     40
8      B    B2      math     95
9      B    B2   english     80
10     B    B3      math     60
11     B    B3   english     45

Unique value kelas: ['A' 'B']
Unique value murid: ['A1' 'A2' 'A3' 'B1' 'B2' 'B3']
Unique value pelajaran: ['math' 'english']
Unique value nilai: [ 90  60  70  85  50 100  40  95  80  45]

# Pivot -> Untuk Unique() Index

In [14]:
import pandas as pd
data = pd.DataFrame({
    "kelas" : 6*["A"] + 6*["B"],
    "murid" : 2*["A1"] + 2*["A2"] + 2*["A3"] + 2*["B1"] + 2*["B2"] + 2*["B3"],
    "pelajaran" : 6*["math","english"],
    "nilai" : [90, 60, 70, 85, 50, 60, 100, 40, 95, 80, 60, 45]
}, columns=["kelas","murid","pelajaran","nilai"])
pivot1 = data.pivot(index="murid", columns="pelajaran")
pivot2 = data.pivot(index="murid", columns="pelajaran", values="nilai")
pivot3 = data.pivot(index="murid", columns="pelajaran", values="kelas")
display(data)
display(pivot1)
display(pivot2)
display(pivot3)

   kelas murid pelajaran  nilai
0      A    A1      math     90
1      A    A1   english     60
2      A    A2      math     70
3      A    A2   english     85
4      A    A3      math     50
5      A    A3   english     60
6      B    B1      math    100
7      B    B1   english     40
8      B    B2      math     95
9      B    B2   english     80
10     B    B3      math     60
11     B    B3   english     45

            kelas        nilai
pelajaran english math english math
murid
A1              A    A      60   90
A2              A    A      85   70
A3              A    A      60   50
B1              B    B      40  100
B2              B    B      80   95
B3              B    B      45   60

pelajaran  english  math
murid
A1              60    90
A2              85    70
A3              60    50
B1              40   100
B2              80    95
B3              45    60

pelajaran english math
murid
A1              A    A
A2              A    A
A3              A    A
B1              B    B
B2              B    B
B3              B    B

# Pivot_Table() -> Untuk Duplicate Index

In [21]:
import pandas as pd
data = pd.DataFrame({
    "kelas" : 6*["A"] + 6*["B"],
    "murid" : 2*["A1"] + 2*["A2"] + 2*["A3"] + 2*["B1"] + 2*["B2"] + 2*["B3"],
    "pelajaran" : 6*["math","english"],
    "nilai" : [90, 60, 70, 85, 50, 60, 100, 40, 95, 80, 60, 45]
}, columns=["kelas","murid","pelajaran","nilai"])

pivot_tab_mean_1 = data.pivot_table(index="kelas", columns="pelajaran", aggfunc="mean")
pivot_tab_mean_2 = data.pivot_table(index="kelas", columns="pelajaran", values="nilai", aggfunc="mean")
display(pivot_tab_mean_1)
display(pivot_tab_mean_2)
pivot_tab_sum_1 = data.pivot_table(index="kelas", columns="pelajaran", aggfunc="sum")
pivot_tab_sum_2 = data.pivot_table(index="kelas", columns="pelajaran", values="nilai", aggfunc="sum")
display(pivot_tab_sum_1)
display(pivot_tab_sum_2)
pivot_tab_median_1 = data.pivot_table(index="kelas", columns="pelajaran", aggfunc="median")
pivot_tab_median_2 = data.pivot_table(index="kelas", columns="pelajaran", values="nilai", aggfunc="median")
display(pivot_tab_median_1)
display(pivot_tab_median_2)

               nilai
pelajaran    english  math
kelas
A          68.333333  70.0
B          55.000000  85.0

pelajaran    english  math
kelas
A          68.333333  70.0
B          55.000000  85.0

            nilai
pelajaran english math
kelas
A             205  210
B             165  255

pelajaran  english  math
kelas
A              205   210
B              165   255

            nilai
pelajaran english math
kelas
A              60   70
B              45   95

pelajaran  english  math
kelas
A               60    70
B               45    95